# Pandas

Series - столбец данных (вектор).

DataFrame - таблица данных (csv обычно).

In [ ]:
import pandas as pd # загрузка pandas
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
# Создание объекта класса Series
salaries = pd.Series(data = [400, 300, 200, 250], index = ["Andrew", "Bob", "John", "Ann"])

In [ ]:
print(salaries)

Andrew    400
Bob       300
John      200
Ann       250
dtype: int64

In [ ]:
type(salaries)

pandas.core.series.Series

In [ ]:
salaries.Andrew # индексирование Series

400

In [ ]:
salaries["Andrew"] # индексирование Series

400

In [ ]:
salaries["Bob"] = 1000 # замена значения в series

In [ ]:
salaries

Andrew     400
Bob       1000
John       200
Ann        250
dtype: int64

In [ ]:
salaries["Bob"] = np.NAN # замена пустым значением

In [ ]:
salaries

Andrew    400.0
Bob         NaN
John      200.0
Ann       250.0
dtype: float64

In [ ]:
salaries["George"] = 10000000

In [ ]:
salaries.mean(), salaries.median() # Медиана робастна к выбросам (устойчива)

(2500212.5, 325.0)

In [ ]:
salaries

Andrew         400.0
Bob              NaN
John           200.0
Ann            250.0
George    10000000.0
dtype: float64

In [ ]:
salaries.fillna(salaries.median(), inplace = True) 

#"""заменяем пустое значение NaN на медианное
#inplace = True - чтобы изменить первоначальный объект
#"""

'заменяем пустое значение NaN на медианное\ninplace = True - чтобы изменить первоначальный объект\n'

In [ ]:
print(salaries)

Andrew         400.0
Bob            325.0
John           200.0
Ann            250.0
George    10000000.0
dtype: float64

# DataFrame

**1-й способ создания DataFrame**

In [ ]:
df1 = pd.DataFrame(data = np.random.randn(5,3), 
                   index = ["s1", "s2", "s3", "s4", "s5"],
                  columns = ["col1", "col2", "col3"])

In [ ]:
print(df1)

        col1      col2      col3
s1 -0.871338  1.134432 -2.106866
s2 -0.661060  1.470402 -1.291175
s3 -0.254749 -0.311897  0.684874
s4 -0.524485  0.285844 -0.433888
s5  1.007432 -0.860260  0.848190

In [ ]:
df1

        col1      col2      col3
s1 -0.871338  1.134432 -2.106866
s2 -0.661060  1.470402 -1.291175
s3 -0.254749 -0.311897  0.684874
s4 -0.524485  0.285844 -0.433888
s5  1.007432 -0.860260  0.848190

**Альтернативный способ создания DataFrame c помощью словаря**

In [ ]:
df2 = pd.DataFrame({"A": np.random.random(5),
                    "B": ["a", "b", "c", "d", "e"],
                    "C": np.arange(5) > 2
})

In [ ]:
df2

          A  B      C
0  0.087907  a  False
1  0.061819  b  False
2  0.070295  c  False
3  0.210861  d   True
4  0.962754  e   True

In [ ]:
df1.info() # основная информация о DataFrame

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, s1 to s5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      float64
 1   col2    5 non-null      float64
 2   col3    5 non-null      float64
dtypes: float64(3)
memory usage: 160.0+ bytes

In [ ]:
df2.info() # основная информация о DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      float64
 1   B       5 non-null      object
 2   C       5 non-null      bool
dtypes: bool(1), float64(1), object(1)
memory usage: 213.0+ bytes

In [ ]:
df2.shape

(5, 3)

In [ ]:
df1.shape

(5, 3)

## Обращение к элементам DataFrame

In [ ]:
df2

          A  B      C
0  0.087907  a  False
1  0.061819  b  False
2  0.070295  c  False
3  0.210861  d   True
4  0.962754  e   True

In [ ]:
df2.loc[[1,4], ["A", "B"]] # 1 и 4 строки столбцов A and B (названия строк и названия столбцов)

          A  B
1  0.061819  b
4  0.962754  e

In [ ]:
df2.iloc[2:4, 0:2] # срез по индексам DataFrame

          A  B
2  0.070295  c
3  0.210861  d

In [ ]:
df2["A"] # обращение к столбцу DataFrame

0    0.087907
1    0.061819
2    0.070295
3    0.210861
4    0.962754
Name: A, dtype: float64

In [ ]:
df2["A"][1] # Первая строка столбца A

0.061819264643940386

In [ ]:
df2[["A", "B"]].iloc[:3] # Первые три строки столбцов A и B

          A  B
0  0.087907  a
1  0.061819  b
2  0.070295  c

## Объединение DataFram-ов

In [ ]:
df2.columns, df1.columns # вывод названий колонк двух датафреймов

(Index(['A', 'B', 'C'], dtype='object'),
 Index(['col1', 'col2', 'col3'], dtype='object'))

In [ ]:
df1.columns = ["A", "B", "C"]

In [ ]:
df1.head(2) # выводим 2 первые строки из данных

           A         B         C
s1 -0.871338  1.134432 -2.106866
s2 -0.661060  1.470402 -1.291175

In [ ]:
df1.tail(2) # две последних строки

           A         B         C
s4 -0.524485  0.285844 -0.433888
s5  1.007432 -0.860260  0.848190

In [ ]:
df3 = df1.append(df2)
df3

           A         B         C
s1 -0.871338   1.13443 -2.106866
s2 -0.661060    1.4704 -1.291175
s3 -0.254749 -0.311897  0.684874
s4 -0.524485  0.285844 -0.433888
s5  1.007432  -0.86026  0.848190
0   0.087907         a  0.000000
1   0.061819         b  0.000000
2   0.070295         c  0.000000
3   0.210861         d  1.000000
4   0.962754         e  1.000000

In [ ]:
df3 = df3.reset_index() # сбрасывает индексы и делает от 0 до n

  index         A         B         C
0    s1 -0.871338   1.13443 -2.106866
1    s2 -0.661060    1.4704 -1.291175
2    s3 -0.254749 -0.311897  0.684874
3    s4 -0.524485  0.285844 -0.433888
4    s5  1.007432  -0.86026  0.848190
5     0  0.087907         a  0.000000
6     1  0.061819         b  0.000000
7     2  0.070295         c  0.000000
8     3  0.210861         d  1.000000
9     4  0.962754         e  1.000000

In [ ]:
df3.head() # выводим первые пять строк

  index         A         B         C
0    s1 -0.871338   1.13443 -2.106866
1    s2 -0.661060    1.4704 -1.291175
2    s3 -0.254749 -0.311897  0.684874
3    s4 -0.524485  0.285844 -0.433888
4    s5  1.007432  -0.86026  0.848190

In [ ]:
df3.drop("index", axis = 1, inplace = True) # удаление столбца из данных

In [ ]:
df3.head()

          A         B         C
0 -0.871338   1.13443 -2.106866
1 -0.661060    1.4704 -1.291175
2 -0.254749 -0.311897  0.684874
3 -0.524485  0.285844 -0.433888
4  1.007432  -0.86026  0.848190

In [ ]:
df1.index = range(5) # замена индексов в датафрейме

In [ ]:
df1.head(2)

          A         B         C
0 -0.871338  1.134432 -2.106866
1 -0.661060  1.470402 -1.291175

In [ ]:
df4 = pd.concat([df1, df2], axis = 1) # склеивание датафреймов по столбцам (axis = 1)

In [ ]:
df4.head()

          A         B         C         A  B      C
0 -0.871338  1.134432 -2.106866  0.087907  a  False
1 -0.661060  1.470402 -1.291175  0.061819  b  False
2 -0.254749 -0.311897  0.684874  0.070295  c  False
3 -0.524485  0.285844 -0.433888  0.210861  d   True
4  1.007432 -0.860260  0.848190  0.962754  e   True

In [ ]:
df4.columns = ["A", "B", "C", "D", "E", "G"] # меняем названия колонок

In [ ]:
df4

          A         B         C         D  E      G
0 -0.871338  1.134432 -2.106866  0.087907  a  False
1 -0.661060  1.470402 -1.291175  0.061819  b  False
2 -0.254749 -0.311897  0.684874  0.070295  c  False
3 -0.524485  0.285844 -0.433888  0.210861  d   True
4  1.007432 -0.860260  0.848190  0.962754  e   True

In [ ]:
df4.iloc[1:3, 2:4] = np.NAN

In [ ]:
df4

          A         B         C         D  E      G
0 -0.871338  1.134432 -2.106866  0.087907  a  False
1 -0.661060  1.470402       NaN       NaN  b  False
2 -0.254749 -0.311897       NaN       NaN  c  False
3 -0.524485  0.285844 -0.433888  0.210861  d   True
4  1.007432 -0.860260  0.848190  0.962754  e   True

In [ ]:
df4.isna().sum() # проверяем наличие пропусков

A    0
B    0
C    2
D    2
E    0
G    0
dtype: int64

In [ ]:
df4.fillna(df4.median(), inplace = True) # замена пропусков на медианные значения

In [ ]:
df4.head()

          A         B         C         D  E      G
0 -0.871338  1.134432 -2.106866  0.087907  a  False
1 -0.661060  1.470402 -0.433888  0.210861  b  False
2 -0.254749 -0.311897 -0.433888  0.210861  c  False
3 -0.524485  0.285844 -0.433888  0.210861  d   True
4  1.007432 -0.860260  0.848190  0.962754  e   True

In [ ]:
df4.drop([2,4], axis = 0) # удаление строк 2 и 4

          A         B         C         D  E      G
0 -0.871338  1.134432 -2.106866  0.087907  a  False
1 -0.661060  1.470402 -0.433888  0.210861  b  False
3 -0.524485  0.285844 -0.433888  0.210861  d   True

In [ ]:
df4.iloc[1:3, 2:4] = np.NAN

In [ ]:
df4

          A         B         C         D  E      G
0 -0.871338  1.134432 -2.106866  0.087907  a  False
1 -0.661060  1.470402       NaN       NaN  b  False
2 -0.254749 -0.311897       NaN       NaN  c  False
3 -0.524485  0.285844 -0.433888  0.210861  d   True
4  1.007432 -0.860260  0.848190  0.962754  e   True

In [ ]:
df4.dropna(how="any", inplace = True) # удаляем строки, где есть хотя бы один пропуск

In [ ]:
df4

          A         B         C         D  E      G
0 -0.871338  1.134432 -2.106866  0.087907  a  False
3 -0.524485  0.285844 -0.433888  0.210861  d   True
4  1.007432 -0.860260  0.848190  0.962754  e   True

# Первичный анализ данных в Pandas

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("beauty.csv", sep = ";") # загрузка данных с файла csv

In [ ]:
df.head() # первые пять строк таблицы

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [ ]:
df.tail() # последние пять строк

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
1255,1.61,25,0,1,1,1,0,1,12,3
1256,1.68,4,0,1,0,1,1,1,12,2
1257,3.29,35,0,1,1,1,0,1,12,3
1258,2.31,15,0,1,1,1,1,1,10,3
1259,1.92,24,0,0,0,1,0,1,16,3

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   wage      1260 non-null   float64
 1   exper     1260 non-null   int64
 2   union     1260 non-null   int64
 3   goodhlth  1260 non-null   int64
 4   black     1260 non-null   int64
 5   female    1260 non-null   int64
 6   married   1260 non-null   int64
 7   service   1260 non-null   int64
 8   educ      1260 non-null   int64
 9   looks     1260 non-null   int64
dtypes: float64(1), int64(9)
memory usage: 98.6 KB

In [ ]:
df.shape # сколько строк, сколько столбцов

(1260, 10)

In [ ]:
df.columns # названия столбцов

Index(['wage', 'exper', 'union', 'goodhlth', 'black', 'female', 'married',
       'service', 'educ', 'looks'],
      dtype='object')

In [ ]:
df.describe().T # Все описательные статистики данных (среднее, СКО, минимум, максимум, квартили, медиана)

           count       mean        std   min      25%   50%     75%    max
wage      1260.0   6.306690   4.660639  1.02   3.7075   5.3   7.695  77.72
exper     1260.0  18.206349  11.963485  0.00   8.0000  15.0  27.000  48.00
union     1260.0   0.272222   0.445280  0.00   0.0000   0.0   1.000   1.00
goodhlth  1260.0   0.933333   0.249543  0.00   1.0000   1.0   1.000   1.00
black     1260.0   0.073810   0.261564  0.00   0.0000   0.0   0.000   1.00
female    1260.0   0.346032   0.475892  0.00   0.0000   0.0   1.000   1.00
married   1260.0   0.691270   0.462153  0.00   0.0000   1.0   1.000   1.00
service   1260.0   0.273810   0.446089  0.00   0.0000   0.0   1.000   1.00
educ      1260.0  12.563492   2.624489  5.00  12.0000  12.0  13.000  17.00
looks     1260.0   3.185714   0.684877  1.00   3.0000   3.0   4.000   5.00

In [ ]:
df["exper"].mean() # средний опыт работы по всем наблюдениям

18.206349206349206

In [ ]:
df["exper"].median() # медианное значение опыта работы по всем наблюдениям

15.0

In [ ]:
df["exper"].std() # дисперсия по столбцу

11.96348525775782

In [ ]:
df["female"].unique() # уникальные значения столбца female

array([1, 0])

In [ ]:
df["female"].value_counts() # распределение по уникальным значениям (т.е. сколько мужчин, сколько женщин)
# 0 - мужчины, 1 - женщины

0    824
1    436
Name: female, dtype: int64

In [ ]:
df[df["female"] == 1] # отбираем все строки с женщинами

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
0,5.73,30,0,1,0,1,1,1,14,4
1,4.28,28,0,1,0,1,1,0,12,3
2,7.96,35,0,1,0,1,0,0,10,4
5,3.91,20,0,0,0,1,1,0,12,3
8,5.00,5,0,1,0,1,0,0,16,3
...,...,...,...,...,...,...,...,...,...,...
1255,1.61,25,0,1,1,1,0,1,12,3
1256,1.68,4,0,1,0,1,1,1,12,2
1257,3.29,35,0,1,1,1,0,1,12,3
1258,2.31,15,0,1,1,1,1,1,10,3
1259,1.92,24,0,0,0,1,0,1,16,3

In [ ]:
df[df["female"] == 0] # отбираем все строки с мужчинами

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
3,11.57,38,0,1,0,0,1,1,16,3
4,11.42,27,0,1,0,0,1,0,16,3
6,8.76,12,0,1,0,0,1,0,16,3
7,7.69,5,1,1,0,0,0,0,16,4
11,4.03,6,0,1,0,0,1,0,16,4
...,...,...,...,...,...,...,...,...,...,...
1248,10.58,19,0,1,0,0,0,0,16,4
1249,8.65,10,1,1,0,0,1,0,13,3
1250,4.17,13,0,1,0,0,1,0,10,3
1251,6.81,7,1,1,0,0,0,0,12,3
1252,9.62,21,1,1,0,0,1,0,16,3

In [ ]:
df[(df["goodhlth"] == 1) & (df["female"] == 1)] # все женщины с хорошим здоровьем

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
0,5.73,30,0,1,0,1,1,1,14,4
1,4.28,28,0,1,0,1,1,0,12,3
2,7.96,35,0,1,0,1,0,0,10,4
8,5.00,5,0,1,0,1,0,0,16,3
9,3.89,12,0,1,0,1,0,0,12,3
...,...,...,...,...,...,...,...,...,...,...
1254,1.79,20,0,1,0,1,1,1,8,3
1255,1.61,25,0,1,1,1,0,1,12,3
1256,1.68,4,0,1,0,1,1,1,12,2
1257,3.29,35,0,1,1,1,0,1,12,3
1258,2.31,15,0,1,1,1,1,1,10,3

In [ ]:
# выберем всех женщин и посчитаем средний заработок за час
df[df["female"] == 1]["wage"].mean()

4.299357798165137

In [ ]:
int(df[df["female"] == 1]["wage"].mean()) # округляем результат

4

In [ ]:
# выберем всех мужчин и посчитаем средний заработок за час
df[df["female"] == 0]["wage"].mean()

7.3688228155339806

In [ ]:
# выберем всех мужчин и посчитаем средний заработок за час
int(df[df["female"] == 0]["wage"].mean())

7

# Задача к данным

Какова максимальная зарплата среди мужчин, имеющих членство в профсоюзе и с опытом работы до 10 лет

In [ ]:
df[(df["union"] == 1) & (df["female"] == 0) & (df["exper"] < 10)]["wage"].max()

12.82

In [ ]:
# Сортировка

df.sort_values(by="wage", ascending=False) # сортировка по столбцу с зарплатой по убыванию (ascending=False)

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
602,77.72,9,1,1,1,1,1,1,13,4
269,41.67,16,0,0,0,0,1,0,13,4
415,38.86,29,0,1,0,0,1,0,13,3
69,32.79,33,0,1,0,0,1,1,16,4
290,31.09,32,0,0,0,0,1,0,13,3
...,...,...,...,...,...,...,...,...,...,...
597,1.16,5,0,1,0,1,1,1,10,3
462,1.16,2,0,1,0,1,0,0,13,4
1226,1.09,8,0,1,0,1,1,1,10,2
1009,1.05,29,0,1,1,0,1,0,5,3
1214,1.02,11,0,1,0,1,1,1,13,3

In [ ]:
# Сортировка

df.sort_values(by=["wage", "female"], ascending=[False, False]).head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
602,77.72,9,1,1,1,1,1,1,13,4
269,41.67,16,0,0,0,0,1,0,13,4
415,38.86,29,0,1,0,0,1,0,13,3
69,32.79,33,0,1,0,0,1,1,16,4
290,31.09,32,0,0,0,0,1,0,13,3

In [ ]:
df.mean()

wage         6.306690
exper       18.206349
union        0.272222
goodhlth     0.933333
black        0.073810
female       0.346032
married      0.691270
service      0.273810
educ        12.563492
looks        3.185714
dtype: float64

In [ ]:
df.apply(np.mean) # применение функции ко всем столбцам датафрейма

wage         6.306690
exper       18.206349
union        0.272222
goodhlth     0.933333
black        0.073810
female       0.346032
married      0.691270
service      0.273810
educ        12.563492
looks        3.185714
dtype: float64